{
  "rooms": [
    {
      "name": "Main"
    },
    {
      "name": "Lobby"
    },
    {
      "name": "Q&A"
    }
  ],
  "sessions": [
    {
      "title": "Continental Angular breakfast",
      "description": "<p>Enjoy the continental breakfast buffet together with the speakers</p>",
      "startDate": "09-12-2016 07:00",
      "endDate": "09-12-2016 08:30",
      "roomId": 1,
      "speakerIds": [
      ],
      "tags": [
        "food-and-drinks",
        "socialize"
      ]
    },
    {
      "title": "Opening ceremony",
      "description": "<p>Welcome messages</p>",
      "startDate": "09-12-2016 08:30",
      "endDate": "09-12-2016 09:00",
      "roomId": 0,
      "speakerIds": [
        10
      ],
      "tags": [
        "ceremony",
        "angular"
      ]
    },
    {
      "title": "Keynote about Angular 2",
      "description": "<p>Opening keynote by Igor Minar</p>",
      "startDate": "09-12-2016 09:00",
      "endDate": "09-12-2016 09:30",
      "roomId": 0,
      "speakerIds": [
        0
      ],
      "tags": [
        "keynote",
        "angular"
      ]
    },
    {
      "title": "Reactive parenting with Angular 2",
      "description": "<p>If concepts like View, ViewContainer, TemplateRef or HostView get your head spinning - fear no more! During this talk I'm going to demystify Angular 2 rendering layer.</p><p>To make things practical all key concepts will be illustrated with real-life examples taken from the https://ng-bootstrap.github.io widget library. Spend 30 minutes with me to learn how to handle complex rendering scenarios like a pro! </p>",
      "startDate": "09-12-2016 09:40",
      "endDate": "09-12-2016 10:10",
      "roomId": 0,
      "speakerIds": [
        6
      ],
      "tags": [
        "angular"
      ]
    },
    {
      "title": "Boosting the security of your Angular 2 application",
      "description": "<p>Angular 2 is hot, and there is a huge amount of information available on building applications, improving performance, and various other topics. But do you know how to make your Angular 2 applications secure? What kind of security features does Angular 2 offer you, and which additional steps can you take to really boost the security of your applications?In this session, we cover one of the most dangerous attacks in modern web applications: XSS. You will learn how Angular 2 protects you against XSS, and why you shouldn't bypass this protection. We will also dive into the new Content Security Policy, and through a few examples, I will show you how you can use CSP to enhance the security in your client-side context.</p>",
      "startDate": "09-12-2016 10:15",
      "endDate": "09-12-2016 10:45",
      "roomId": 0,
      "speakerIds": [
        9
      ],
      "tags": [
        "security",
        "angular"
      ]
    },
    {
      "title": "Fresh & healty NG Break",
      "description": "<p>Socialize - Break with coffees, teas, juices, fresh yoghurts and fruits</p>",
      "startDate": "09-12-2016 10:45",
      "endDate": "09-12-2016 11:10",
      "roomId": 1,
      "speakerIds": [
      ],
      "tags": [
        "food-and-drinks",
        "socialize"
      ]
    },
    {
      "title": "Sponsor: ARHS",
      "description": "<p>ARHS, our Gold sponsor partner will give a introductory short talk of their company and how they use Angular 2 in professional environment.</p>",
      "startDate": "09-12-2016 11:10",
      "endDate": "09-12-2016 11:15",
      "roomId": 0,
      "speakerIds": [
      ],
      "tags": [
        "sponsor",
        "angular"
      ]
    },
    {
      "title": "Unleashing the power of GraphQL using Angular 2",
      "description": "<p>GraphQL was developed internally at Facebook in 2012. Its main goal was to allow Native Mobile teams to quickly build new products and collaborate within the large Facebook ecosystem without disrupting existing Data Services. In this talk we are going to introduce GraphQL and how we can use it together with the Apollo Client in Angular 2.</p>",
      "startDate": "09-12-2016 11:20",
      "endDate": "09-12-2016 12:00",
      "roomId": 0,
      "speakerIds": [
        4
      ],
      "tags": [
        "tooling",
        "angular"
      ]
    },
    {
      "title": "Scalable Angular Application Architecture",
      "description": "<p>Modern web applications have constantly growing requirements and their complexity grows exponentially. Some of the biggest challenges in front of us are state management, testability and flexibility. Given the dynamic business environment we need to make sure our projects' design uses well known patterns most developers are familiar with.</p><p>In this talk I’ll introduce a scalable Angular 2 application architecture, which answers the following requirements</p>:<li>Testability</li><li>Predictable state management</li><li>Scalable communication layer</li><li>Modular and robust design</li></ul>",
      "startDate": "09-12-2016 12:10",
      "endDate": "09-12-2016 12:40",
      "roomId": 0,
      "speakerIds": [
        3
      ],
      "tags": [
        "architecture",
        "angular"
      ]
    },
    {
      "title": "Healthy Angular Lunch",
      "description": "<p>Lunch time: fresh soup, salads, selections of cold and warm fish and meat dishes, dessert</p>",
      "startDate": "09-12-2016 12:40",
      "endDate": "09-12-2016 14:00",
      "roomId": 1,
      "speakerIds": [
      ],
      "tags": [
        "food-and-drinks"
      ]
    },
    {
      "title": "Angular 2 and React: friends learning from each other",
      "description": "<p>React and Angular 2 share a lot of architectural decisions and have inspired each other as well. They are both component oriented, have automated changed detection and can render both on the server as well as on the client side. However, there are also quite a few differences in how they work and which philosophy they follow.</p><p>Based on advanced practical examples we will look at the most interesting differences between those two frameworks. This can help you understand your Angular 2 framework even better and gives you insights into what strengths and what weaknesses it has in certain scenarios.</p>",
      "startDate": "09-12-2016 14:05",
      "endDate": "09-12-2016 14:40",
      "roomId": 0,
      "speakerIds": [
        1,11
      ],
      "tags": [
        "react",
        "architecture",
        "angular"
      ]
    },
    {
      "title": "Sponsor: Ordina",
      "description": "<p>Ordina, our Platinum sponsor partner will give a introductory short talk of their company and how they use Angular 2 in professional environment.</p>",
      "startDate": "09-12-2016 14:45",
      "endDate": "09-12-2016 14:55",
      "roomId": 0,
      "speakerIds": [
      ],
      "tags": [
        "sponsor",
        "angular"
      ]
    },
    {
      "title": "Practical AngularJS DevOps",
      "description": "<p>From writing the AngularJS sources in your favorite code editor to running the application in a production environment, involves a considerable amount of steps. There are the basic steps of transpiling, packing up your files, minification, etc. And to make sure that we have a quality app, we add some unit testing and code coverage to the mix, optionally performing some performance testing. By the way, we need to perform the actual production deployment too.</p><p>In this session we'll look at a practical example of how to setup a fully automated release pipeline, so that you can focus on writing code rather than operating a deployment infrastructure.</p>",
      "startDate": "09-12-2016 15:00",
      "endDate": "09-12-2016 15:30",
      "roomId": 0,
      "speakerIds": [
        8
      ],
      "tags": [
        "tooling",
        "angular"
      ]
    },
    {
      "title": "Fresh & healty NG Break",
      "description": "<p>Socialize - Break with coffees, teas, juices, fresh yoghurts and fruits</p>",
      "startDate": "09-12-2016 15:40",
      "endDate": "09-12-2016 15:55",
      "roomId": 1,
      "speakerIds": [
      ],
      "tags": [
        "food-and-drinks"
      ]
    },
    {
      "title": "Step by Step: Improving Start-up Performance with Lazy Loading in Angular 2",
      "description": "<p>Angular 2 applications can lazily load modules to improve start-up performance. This session shows by example how to optimize solutions using this approach. Potential pitfalls are described and information is presented about asynchronously preloading modules with both builtin and user-generated strategies to speed up lazy loading.</p>",
      "startDate": "09-12-2016 16:00",
      "endDate": "09-12-2016 16:40",
      "roomId": 0,
      "speakerIds": [
        7
      ],
      "tags": [
        "architecture",
        "angular"
      ]
    },
    {
      "title": "Sponsor: aariXa",
      "description": "<p>aariXa, our Gold sponsor partner will give a introductory short talk of their company and how they use Angular 2 in professional environment.</p>",
      "startDate": "09-12-2016 16:40",
      "endDate": "09-12-2016 16:45",
      "roomId": 0,
      "speakerIds": [
      ],
      "tags": [
        "sponsor",
        "angular"
      ]
    },
    {
      "title": "Angular 2 Forms, the hero we need but not the one we deserve.",
      "description": "<p></p>",
      "startDate": "09-12-2016 16:50",
      "endDate": "09-12-2016 17:20",
      "roomId": 0,
      "speakerIds": [
        2
      ],
      "tags": [
        "forms",
        "angular"
      ]
    },
    {
      "title": "Making SVG and Canvas Graphics in Angular",
      "description": "<p>When it comes to putting stuff on the screen in Angular webapps, HTML+CSS is usually the most appropriate medium. But it’s not the only game in town. Alternative APIs such as SVG and Canvas can provide a lot of extra power when you need it for those dazzling visualizations, UI effects, games, and artistic apps.</p><p>But there are some things we should understand about these technologies before we use them with Angular. SVG DOM can be rendered and animated like HTML DOM but it needs a bit of special care. Canvas is a completely different story with its immediate mode drawing API, but we can still easily integrate it into our Angular components. In this talk we’ll look at how SVG and Canvas graphics can be created with Angular and what we have to keep in mind as we do it.</p>",
      "startDate": "09-12-2016 17:30",
      "endDate": "09-12-2016 18:00",
      "roomId": 0,
      "speakerIds": [
        5
      ],
      "tags": [
        "canvas",
        "angular"
      ]
    },
    {
      "title": "Closing ceremony",
      "description": "<p>Closing messages</p>",
      "startDate": "09-12-2016 18:00",
      "endDate": "09-12-2016 18:30",
      "roomId": 0,
      "speakerIds": [
        10
      ],
      "tags": [
        "angular",
        "ceremony"
      ]
    },
    {
      "title": "Socialize & network time",
      "description": "<p>Enjoy some quality time with your collegeaus and reflect about the conference!</p>",
      "startDate": "09-12-2016 18:30",
      "endDate": "09-12-2016 19:30",
      "roomId": 1,
      "speakerIds": [
      ],
      "tags": [
        "food-and-drinks",
        "socialize"
      ]
    }
  ],
  "speakers": [
    {
      "avatar": "https://ng-be.org/components/conference-day/img/igor-minar.jpg",
      "description": "Igor is a lead on the Angular project, practitioner of test driven development, open source enthusiast and hacker. In his free time, Igor enjoys spending time with his wife and two kids, doing outdoor activities.",
      "firstname": "Igor",
      "github": "IgorMinar",
      "name": "Minar",
      "role": "Angular Team Lead at Google",
      "twitter": "IgorMinar"
    },
    {
      "avatar": "https://ng-be.org/components/conference-day/img/pascal-precht.jpg",
      "description": "Pascal is a front-end engineer and an Angular Developer Expert nominated by Google. He created the angular-translate module, is an Angular 2 contributor and also part of the Angular 2 Docs Authoring team.",
      "firstname": "Pascal",
      "github": "pascalprecht",
      "name": "Precht",
      "role": "Trainer at @thoughtram, Google Developer Expert",
      "twitter": "pascalprecht"
    },
    {
      "avatar": "https://ng-be.org/components/conference-day/img/todd-motto.jpg",
      "description": "JavaScript, Angular, React, conference speaker. Developer Expert at Google, open source lover.",
      "firstname": "Todd",
      "github": "toddmotto",
      "name": "Motto",
      "role": "Developer Advocate @Telerik. Founder of Voux, Google Developer Expert",
      "twitter": "ToddMotto"
    },
    {
      "avatar": "https://ng-be.org/components/conference-day/img/minko-gechev.jpg",
      "description": "Minko runs training courses in JavaScript and Angular. He has developed numerous projects such as AngularJS 1.x and Angular 2 style guides, angular2-seed, codelyzer, aspect.js, angular-aop, and many others.",
      "firstname": "Minko",
      "github": "mgechev",
      "name": "Gechev",
      "role": "Web hacker. Author of 'Switching to Angular 2'",
      "twitter": "mgechev"
    },
    {
      "avatar": "https://ng-be.org/components/conference-day/img/gerard-sans.jpg",
      "description": "Gerard is a Computer Science Engineer & Google Developer Expert. As an Angular fanboy and community activist he is fighting for the JavaScript revolution. Having lived and worked for all sorts of companies over the whole world, he is always up for a good challenge. He likes running AngularZone London, mentoring students & participating in the community.",
      "firstname": "Gerard",
      "github": "gsans",
      "name": "Sans",
      "role": "Community leader. Google Developer Expert",
      "twitter": "gerardsans"
    },
    {
      "avatar": "https://ng-be.org/components/conference-day/img/tero-parviainen.jpg",
      "description": "Tero Parviainen is an independent software developer, writer of programming books and articles, and an Angular 2 docs contributor.",
      "firstname": "Tero",
      "github": "teropa",
      "name": "Parviainen",
      "role": "Independent Contractor",
      "twitter": "teropa"
    },
    {
      "avatar": "https://ng-be.org/components/conference-day/img/pawel-kozlowski.jpg",
      "description": "Pawel is a software-development addict who believes in free, open source software. He is a core contributor to the Angular framework, AngularUI, Karma-runner and several other projects. Currently obsessed with making Angular 2 the best web development platform ever. When not coding, Pawel can be spotted speaking at various software development conferences.",
      "firstname": "Pawel",
      "github": "pkozlowski-opensource",
      "name": "Kozlowski",
      "role": "Messing with the web @AmadeusITGroup. Angular team member.",
      "twitter": "pkozlowski_os"
    },
    {
      "avatar": "https://ng-be.org/components/conference-day/img/manfred-steyer.jpg",
      "description": "Trainer and Consultant with focus on Angular. Writes for O'Reilly, Hanser, windows.developer and Heise Developer. Regularly speaks at conferences.",
      "firstname": "Manfred",
      "github": "manfredsteyer",
      "name": "Steyer",
      "role": "Freelance trainer and consultant. Focus on modern Web & service architectures.",
      "twitter": "ManfredSteyer"
    },
    {
      "avatar": "https://ng-be.org/components/conference-day/img/nick-trogh.png",
      "description": "Nick is a technical evangelist at Microsoft Belux where he’s helping developers, startups and software companies realize their software dreams on the Microsoft platform. You can find him speaking about cloud, mobile, web and game development at conferences or meetups.",
      "firstname": "Nick",
      "name": "Trogh",
      "role": "Sr. Technical Evangelist",
      "twitter": "nicktrog"
    },
    {
      "avatar": "https://ng-be.org/components/conference-day/img/philippe-deryck.jpg",
      "description": "Philippe De Ryck is a professional speaker and trainer on software security and web security. Since he obtained his PhD at the imec-DistriNet research group (KU Leuven, Belgium), he has been running the group's Web Security Training program, which ensures a sustainable knowledge transfer of the group’s security expertise towards practitioners.",
      "firstname": "Philippe",
      "github": "philippederyck",
      "name": "De Ryck",
      "role": "Trainer in Web Security",
      "twitter": "philippederyck"
    },
    {
      "avatar": "https://ng-be.org/components/team/img/carmen-popoviciu.jpg",
      "description": "Carmen is a frontend engineer and a big smiley in the Angular community - or so she has been told. She likes writing code and solving challenging puzzles. Give her something interesting to work on and you can pick her up in a couple of hours ;). She tries to help others out whenever she can and strongly believes that it's the small things that make a difference. If she had superpowers, she would smiley all the things.",
      "firstname": "Carmen",
      "github": "CarmenPopoviciu",
      "name": "Popoviciu",
      "role": "Frontend engineer at Widespread",
      "twitter": "CarmenPopoviciu"
    },
    {
      "avatar": "https://ng-be.org/components/conference-day/img/oliver-zeigermann.jpg",
      "description": "Oliver Zeigermann is a developer and architect from Hamburg, Germany. Oliver is the co-author of the best selling German book on React, Redux, React Router, and Universal Rendering. He has also worked in several Angular and React projects using Flow and TypeScript",
      "firstname": "Oliver",
      "github": "DJCordhose",
      "name": "Zeigermann",
      "role": "Freelance web developer",
      "twitter": "DJCordhose"
    }
  ]
}
